package level1;

/**
 * CodeGym / Java Course / 자바 구문 / 디에고가 보낸 연습 문제
 * 레벨 1, 레슨 5
 */
public class Lesson5 {
    public static void main(String[] args) {
        solution();
    }

    /**
     * - "아미고, 프로그래머가 되고 싶니?"
     * - "물론이예요!"
     * - "그럼 이 문구를 출력하는 프로그램을 작성해 봐 "모두 안녕하세요!"
     * - "하지만... 너무 식상하지!"
     * -"맞아요. 아미고, 우리 서로 통하네. 잘됐어. 대신 이렇게 하자. 우린 로봇이니까 불확실할 때 반복해야 할 문구를 출력하자. 즉, "키스해, 내 금속 빛깔 후부 작동기!"
     * 요구 사항:
     * •	텍스트를 출력하는 프로그램이어야 합니다.
     * •	"키스해"라는 문구로 텍스트를 시작해야 합니다.
     * •	텍스트를 느낌표로 끝내야 합니다.
     * •	텍스트는 스페이스와 느낌표를 포함하여 20자로 구성해야 합니다.
     * •	출력한 텍스트는 과제 조건과 일치해야 합니다.
     */
    private static void solution() {
        System.out.println("키스해, 내 금속 빛깔 후부 작동기!");
    }
}
