/**
 * CodeGym 과제
 */
public class Main {
    public static void main(String[] args) {
        solution2();
    }

    /**
     * CodeGym / Java Course / 자바 구문 / 첫 번째 프로그램 준비 완료
     * 레벨0, 레슨3
     *
     * 다음 문구를 출력하는 프로그램을 작성하십시오. "프로그래머가 되는 것은 멋진 일이라고 생각합니다".
     *
     * 예제 출력:
     * 프로그래머가 되는 것은 멋진 일이라고 생각합니다
     * 요구 사항:
     * •	텍스트를 출력하는 프로그램이어야 합니다.
     * •	"프로그래머가"라는 문구로 텍스트를 시작해야 합니다.
     * •	"생각합니다."라는 문구로 텍스트를 끝내야 합니다.
     * •	텍스트는 스페이스와 구두점을 포함하여 34개의 문자로 구성합니다.
     * •	텍스트를 한 줄로 출력해야 합니다.
     * •	출력한 텍스트는 과제 조건과 일치해야 합니다.
     */
    public static void solution2() {
        System.out.print("프로그래머가 ");
        System.out.print("되는 것은 ");
        System.out.print("멋진 ");
        System.out.print("일이라고 ");
        System.out.print("생각합니다");
    }

    /**
     * CodeGym / Java Course / 자바 구문 / 가상 머신과 첫 명령어
     * 레벨0, 레슨2
     *
     * 다음 문구를 출력하는 프로그램을 작성하십시오. "아미고는 아주 영리하다".
     *
     * 예제 출력:
     * 아미고는 아주 영리하다
     * 요구 사항:
     * •	텍스트를 출력하는 프로그램이어야 합니다.
     * •	"아미고"라는 문구로 텍스트를 시작해야 합니다.
     * •	"영리하다"라는 문구로 텍스트를 끝내야 합니다.
     * •	텍스트는 공백을 포함하여 19자로 구성되어야 합니다.
     * •	출력한 텍스트는 과제 조건과 일치해야 합니다.
     */
    public static void solution1() {
        System.out.println("아미고는 아주 영리하다");
    }
}